Revit 2024 API
BuiltInFailures.StairRampFailures.StairsGenericTransformFailure Property
 Cannot change base elevation of Stairs
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId StairsGenericTransformFailure { get; }
Visual Basic
Public Shared ReadOnly Property StairsGenericTransformFailure As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ StairsGenericTransformFailure {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace